#ifndef	_Symb2DOldVersions_H_
#define _Symb2DOldVersions_H_

#include "ISymbol.hpp"
#include "ProfileAdditionalInfo.hpp"
#include "AC19SymbolTypes.hpp"
#include "SyHatch.hpp"

// -----------------------------------------------------------------------------
// Constants
// -----------------------------------------------------------------------------

#define	Info_5_Len	 8					// Elem ID length, till 4.16
#define	Info_9_Len	12					// Elem ID length


#if defined (_MSC_VER) || (defined (__SC__) && !defined (macintosh))	// mm-sc7
#pragma pack (1)
//lint -align_max(1)
#endif

#if defined (macintosh)
#pragma pack (2)
#endif


//******************************************************************************
// Old Symbol2D structures
//******************************************************************************

typedef	char		Info_5_Type [Info_5_Len];

typedef	char		Info_9_Type [Info_9_Len];


#define SINGLE_ARG(...) __VA_ARGS__

#if defined (_MSC_VER)
#define DEF_STRUCT_CHECKALIGN(A, B)					\
	__pragma (pack(push))							\
	__pragma (pack (1))								\
struct A B;											\
	__pragma (pack (8))								\
struct A##_8 B;										\
	__pragma (pack(pop))							\
	static_assert (sizeof (A) == sizeof (A##_8), "Size equality error!")

#define DEF_STRUCT_WITH_DEFAULT_CONSTRUCTOR_CHECKALIGN(A, B)			\
	__pragma (pack(push))												\
	__pragma (pack (1))													\
struct A {B inline A(); };												\
	__pragma (pack (8))													\
struct A##_8 {B};														\
	__pragma (pack(pop))												\
	static_assert (sizeof (A) == sizeof (A##_8), "Size equality error!")

#else
#define DEF_STRUCT_CHECKALIGN(A, B)	 struct A B;
#define DEF_STRUCT_WITH_DEFAULT_CONSTRUCTOR_CHECKALIGN(A, B)	 struct A {B inline A(); }
#endif


typedef struct {						// Symbol handle header record (50 Byte)
	short			nLine;				// Number of lines in the Symbol
	short			nCirc;				// Number of circles in the Symbol
	short			nArc;				// Number of arcs in the Symbol
	short			nHotsp;				// Number of hotspots in the Symbol
	short			nText;				// Number of Texts in the Symbol
	short			nHatch;				// Number of Hatches in the Symbol
	F_BoxType		box; 				// Boundaries of the Symbol's immage
	Int32			circOff;			// Offset of the circles from Dummy
	Int32			arcOff;				// Offset of the arcs from Dummy
	Int32			hotspOff;			// Offset of the hotspots from Dummy
	Int32			textOff;			// Offset of the Texts from Dummy
	Int32			hatchOff;			// offset of the hatches from Dummy
	short			dummy; 				// Base adress of Symbol data
	// Symbol data follows here if any
} Sy_7_Type, **Sy_7_Hdl;
static_assert (sizeof (Sy_7_Type) == 50, "sizeof (Sy_7_Type) != 50");

typedef struct {						// Symbol handle header record (60+2 Byte)
	Int32			nLine;				// Number of lines in the Symbol
	Int32			nCirc;				// Number of circles in the Symbol
	Int32			nArc;				// Number of arcs in the Symbol
	Int32			nHotsp;				// Number of hotspots in the Symbol
	Int32			nText;				// Number of Texts in the Symbol
	Int32			nHatch;				// Number of Hatches in the Symbol
	F_BoxType		box; 				// Boundaries of the Symbol's immage if object, other information if door/window
	Int32			circOff;			// Offset of the circles from Dummy
	Int32			arcOff;				// Offset of the arcs from Dummy
	Int32			hotspOff;			// Offset of the hotspots from Dummy
	Int32			textOff;			// Offset of the Texts from Dummy
	Int32			hatchOff;			// offset of the hatches from Dummy
	short			dummy; 				// Base adress of Symbol data
	// Symbol data follows here if any
} Sy_9_Type, **Sy_9_Hdl;				// SyType; SyHdl
static_assert (sizeof (Sy_9_Type) == 62, "sizeof (Sy_9_Type) != 62");

typedef struct {						//          ----- HATCH_1 -----
	char			pen;				// Color index (0 if deleted)
	char			pattern;			// Line type (not used)
	char			fillPat;			// Hatching number
	char			filler;				// Not used, only for byte reserving
	short			layer;				// Layer index
	short			clipNum;			// Number of polygons making up hatch
	Int32			coordOff;			// Offset of the vertex coordinates
	Int32			clipOff;			// Offset of the polygon declarations
} SHatch_1_Type;
static_assert (sizeof (SHatch_1_Type) == 16, "sizeof (SHatch_1_Type) != 16");

typedef struct {						// General polygon master record
	Int32			id;					// Poligon ID number
	unsigned char	contPen; 			// Contour line color (0 if not framed hatch)
	unsigned char	contLType; 			// Contour line type
	unsigned char	fillPen; 			// Hatching color  (0 if not hatched)
	unsigned char	fillPat;			// Hatching number (0 if not hatched)
	short			nCoords; 			// Number of vertices
	short			nSubPolys;			// Number of closed sub polygons including the first one
	short			nArcs;				// Number of curves in the polygon
	float			surface;			// Reserved
	Int32			dummy;				// For future use
} MyPoly_3_Type;						// My_416_Polygon
static_assert (sizeof (MyPoly_3_Type) == 22, "sizeof (MyPoly_3_Type) != 22");

typedef struct {
	char			exist;				// Active/sleep/deleted
	char			filler;				// Not used, only for byte reserving
	short			layer;				// Layer index
	MyPoly_3_Type	poly;				// Polygon record
	Int32			dummy;				// For future use
	Int32			myPolyCoordsLength;	// Length of polygon coordinates
	Int32			mySubPolyEndsLength;// Length of subpolygon borders
	Int32			myPolyArcsLength;	// Length of polygon arcs
} SHatch_3_Type;
static_assert (sizeof (SHatch_3_Type) == 42, "sizeof (SHatch_3_Type) != 42");

typedef struct {
	char			exist;				// Active/sleep/deleted
	char			fill1;				// Not used, only for byte reserving
	short			layer;				// Layer index
	MyPoly_3_Type	poly;				// Polygon record
	bool			global;				// True, if fill not linked
	char			fill2;				// Not used, only for byte reserving
	Geometry::Point2f			offset;				// Base of fill reference vector
	float			angle;				// Angle of fill reference vector
	Info_5_Type		info;				// Info record
} Hatch_5_Type;							// Hatch_400_Type
static_assert (sizeof (Hatch_5_Type) == 48, "sizeof (Hatch_5_Type) != 48");

typedef struct {						// Record for symbol hatch data
	Int32			syHRecLen;
	Hatch_5_Type	syHatch;
	Int32			dummy;
	Int32 			myPolyCoordsLength;
	Int32 			mySubPolyEndsLength;
	Int32 			myPolyArcsLength;
} SHatch_5_Type;						// syHatch_400_Type
static_assert (sizeof (SHatch_5_Type) == 68, "sizeof (SHatch_5_Type) != 68");

typedef struct {
	char			exist;				// active/sleep/deleted
	char			fill1;
	short			layer;   			// layer
	MyPoly_3_Type	poly;	  			// polygon record
	bool			global;				// TRUE if fill not linked to the element
	char			fill2;
	Geometry::Point2f			offset;				// base coordinate of fill reference vetor if linked to the element
	float			angle;				// angle of fill reference vetor if linked to the element
	Info_5_Type		info;				// info
	short			textNum;			// Area text's num OR 0
} Hatch_7_Type;							// Hatch_416_Type
static_assert (sizeof (Hatch_7_Type) == 50, "sizeof (Hatch_7_Type) != 50");

typedef struct {						// Record for symbol hatch data
	Int32			syHRecLen;
	Hatch_7_Type	syHatch;
	Int32			dummy;
	union {
		struct {
			Int32 dummy1;//Geometry::Point2f	*myPolyCoordsPtr;	// This Ptrs must be disposed after a GetSyItem call
			Int32 dummy2;//short 	*mySubPolyEndsPtr;
			Int32 dummy3;//Int32	*myPolyArcsPtr;		// ez nem az uj PolyArcRec volt!
		} p;
		struct {
			Int32 	myPolyCoordsLength;
			Int32 	mySubPolyEndsLength;
			Int32 	myPolyArcsLength;
		} l;
	} u;
} SHatch_7_Type;						// SyHatch_416_Type, *SyHatch_416_Ptr;
static_assert (sizeof (SHatch_7_Type) == 70, "sizeof (SHatch_7_Type) != 70");

typedef struct {						// General polygon master record
	Int32			id;					// Poligon ID number
	unsigned char	contPen; 			// Contour line color (0 if not framed hatch)
	unsigned char	contLType; 			// Contour line type
	unsigned char	fillPen; 			// Hatching color  (0 if not hatched)
	unsigned char	fillPat;			// Hatching number (0 if not hatched)
	short			nCoords; 			// Number of vertices
	short			nSubPolys;			// Number of closed sub polygons including the first one
	short			nArcs;				// Number of curves in the polygon
	short			fill;				// sm8a
	float			surface;			// Reserved
	Int32			dummy1;
	Int32			dummy2;
} MyPoly_9_Type;						// MyPolygon
static_assert (sizeof (MyPoly_9_Type) == 28, "sizeof (MyPoly_9_Type) != 28");

typedef struct {
	char			exist;				// active/sleep/deleted
	bool			global;				// TRUE if fill not linked to the element
	short			layer;				// Layer
	Int32			unId;				// unique Id
	Info_9_Type		info;				// user information
	F_BoxType 		bounds;				// container bounds 2D
	MyPoly_9_Type	poly;	  			// polygon record
	Int32			textNum;			// Area text's num OR 0
	Geometry::Point2f			offset;				// base coordinate of fill reference vector if linked to the element
	float			angle;				// angle of fill reference vector if linked to the element
	Int32			dummy1;
	Int32			dummy2;
	Int32			dummy3;
	Int32			dummy4;
} Hatch_9_Type;
static_assert (sizeof (Hatch_9_Type) == 96, "sizeof (Hatch_9_Type) != 96");

typedef struct {						// Record for symbol hatch data
	Int32			syHRecLen;
	Hatch_9_Type	syHatch;
	Int32			dummy;
	union {
		struct {
			Int32 dummy1;//Geometry::Point2f	*myPolyCoordsPtr;	// This Ptrs must be disposed after a GetSyItem call
			Int32 dummy2;//short 	*mySubPolyEndsPtr;
			Int32 dummy3;//Int32	*myPolyArcsPtr;		// ez nem az uj PolyArcRec volt!
		} p;
		struct {
			Int32 	myPolyCoordsLength;
			Int32 	mySubPolyEndsLength;
			Int32 	myPolyArcsLength;
		} l;
	} u;
} SHatch_9_Type;						// SyHatchType
static_assert (sizeof (SHatch_9_Type) == 116, "sizeof (SHatch_9_Type) != 116");

typedef struct {
	short			pen;				// Color index (0 if deleted)
	short			layer;				// Layer index
	short			dimForm;			// FloorPlanDim, LevelDim, Elevation
	short			dimNum;				// 0 means no dim., simple text
	Geometry::Point2f			loc;				// Real coordinates of text centre
	float			size;				// Scale independent letter size in mm
	float			angle;				// Angle of text letters in rad
	float			slant;				// Slant of text letters in rad
	Int32			nChars;				// Number of characters
} Text_1_Type;
static_assert (sizeof (Text_1_Type) == 32, "sizeof (Text_1_Type) != 32");

typedef struct {
	char			fill;				// Not used, only for byte reserving
	char			pen;				// Color index (0 if deleted)
	short			layer;				// Layer index
	short			dimForm;			// FloorPlanDim, LevelDim, Elevation
	short			dimNum;				// 0 means no dim., simple text
	Geometry::Point2f			loc;				// Real coordinates of text centre
	float			size;				// Scale independent letter size in mm
	float			angle;				// Angle of text letters in rad
	float			slant;				// Slant of text letters in rad
	Int32			nChars;				// Number of characters
	short			fontId;				// ID number of the text font
	float			len;				// Length of text
} Note_3_Type;							// Note_343_Type;
static_assert (sizeof (Note_3_Type) == 38, "sizeof (Note_3_Type) != 38");

typedef struct {
	char			fill;
	char			pen;				// Color information 0 if deleted
	short			layer;				// Layer
	char			dimSubNum;		    // hanyadik note-je ez a dim-nek sm5n
	char			dimForm;			// (FloorPlanDim, LevelDim, ElevationDim, AreaDim)
	short			dimNum;				// 0 means no dim., simple text [impossible since 4.0]
	Geometry::Point2f			loc;				// Real coordinates of left bottom
	float			size;				// Letter size in mm independent of scale [vertical]
	float			angle;				// Text angle in rad
	float			slant;				// Text slant in rad (pi/2 is plain text)
	Int32			nChars;				// content OR offset
	short			fontId;				// ID number of the notes font
	float			len;				// horizontal size in mm
} Note_5_Type;							// Note_405_Type

typedef struct {
	char			fill;				// Not used, only for byte reserving
	char			pen;				// Color index (0 if deleted)
	short			layer;				// Layer index
	short			dimForm;			// FloorPlanDim, LevelDim, Elevation
	short			dimNum;				// 0 means no dim., simple text
	short			centre;				// Kind of text centre
	Geometry::Point2f			loc;				// Real coordinates of text centre
	float			width;				// Horizontal size of text box in mm
	float			height;				// Vertical size of text box in mm
	float			size;				// Scale independent letter size in mm
	float			spac;				// Spaceing between text lines in mm
	float			angle;				// Angle of text letters in rad
	float			slant;				// Slant of text letters in rad
	unsigned char	face;				// Style of text
	char			fill2;				// Not used, only for byte reserving
	short			font;				// ID number of the text font
	short			just;				// Text justification in the text box
	short			lines;				// Number of text lines
	Int32			contLen;			// Length of the text
	Int32			startLen;			// Length of line starting positions
} Word_5_Type;							// Word_405_Type
static_assert (sizeof (Word_5_Type) == 58, "sizeof (Word_5_Type) != 58");

typedef struct {
	Int32			syWRecLen;
	Word_5_Type		syWord;
} SWord_5_Type;							// SyWord_405_Type
static_assert (sizeof (SWord_5_Type) == 62, "sizeof (SWord_5_Type) != 62");

typedef struct {
	char			fill;				// Not used, only for byte reserving
	char			pen;	  			// Color information, 0 if deleted
	short	 		layer;				// Layer
	Int32			dimDummy;			// dimForm, num; always 0 (word is never dim)
	short			centre;				// Kind of text centre
	Geometry::Point2f			loc;				// Real coordinates of text centre
	float			width;				// Horizontal size of text box in mm
	float			height;				// Vertical size of text box in mm
	float			size; 				// Letter size in mm independent of scale
	float			spac;				// Spacing between text lines in mm
	float			angle; 				// Angle of text letters in rad
	float			slant; 				// Slant of text letters in rad (pi/2 is plain text)
	unsigned char	face;				// Style of text
	char			fill1;
	short			font;				// ID number of the text font
	short			just;				// Justification of text
	short			lines;				// Number of text lines
	Int32			textId;				// id to text content & line starts
	Int32			dummy;
} Word_7_Type;							// Word_416_Type;
static_assert (sizeof (Word_7_Type) == 58, "sizeof (Word_7_Type) != 58");

typedef struct {						// Record for symbol word data
	Int32			syWRecLen;
	Word_7_Type		syWord;
	union {
		struct {
			Int32 dummy1;	//GSPtr 	myContentPtr;		// This Ptrs must be disposed after a GetSyItem call
			Int32 dummy2;	//short 	*mylStartsPtr;
		} p;
		struct {
			Int32 	myContentLength;
			Int32 	mylStartsLength;
		} l;
	} u;
} SWord_7_Type;							// SyWord_416_Type,	*SyWord_416_Ptr;
static_assert (sizeof (SWord_7_Type) == 70, "sizeof (SWord_7_Type) != 70");

typedef struct {
	char			pen;	  			// Color information, 0 if deleted
	char			fill;				// Not used, only for byte reserving
	short	 		layer;				// Layer
	Int32			unId;				// unique Id
	Geometry::Point2f			loc;				// Real coordinates of text centre
	float			width;				// Horizontal size of text box in mm
	float			height;				// Vertical size of text box in mm
	float			size; 				// Letter size in mm independent of scale
	float			spac;				// Spacing between text lines in mm
	float			angle; 				// Angle of text letters in rad
	float			slant; 				// Slant of text letters in rad (pi/2 is plain text)
	unsigned char	face;				// Style of text
	char			centre;				// Kind of text centre
	short			font;				// ID number of the text font
	short			just;				// Justification of text
	short			lines;				// Number of text lines
	Int32			textId;				// id to text content & line starts
	Int32			dummy1;
	Int32			dummy2;
} Word_9_Type;							// WordType
static_assert (sizeof (Word_9_Type) == 60, "sizeof (Word_9_Type) != 60");

typedef struct {						// Record for symbol word data
	Int32			syWRecLen;
	Word_9_Type		syWord;
	union {
		struct {
			Int32 dummy1;	//GSPtr 	myContentPtr;		// This Ptrs must be disposed after a GetSyItem call
			Int32 dummy2;	//short 	*mylStartsPtr;
		} p;
		struct {
			Int32 	myContentLength;
			Int32 	mylStartsLength;
		} l;
	} u;
} SWord_9_Type;							// SyWord_9_Type, *SyWord_9_Ptr;
static_assert (sizeof (SWord_9_Type) == 72, "sizeof (SWord_9_Type) != 72");

typedef struct {
	char			pen;				// Color index (0 if deleted)
	char			pattern;			// Pattern/linetype information
	Geometry::Point2f			begC;				// Coordinates of the first point
	Geometry::Point2f			endC;				// Coordinates of the second point
	short			layer;				// Layer index
} Lin_1_Type;							// Lin_343_Type;
static_assert (sizeof (Lin_1_Type) == 20, "sizeof (Lin_1_Type) != 20");

typedef struct {
	char			pen;				// Color index (0 if deleted)
	char			pattern;			// Pattern/linetype information
	Geometry::Point2f			begC;				// Coordinates of the first point
	Geometry::Point2f			endC;				// Coordinates of the second point
	short			layer;				// Layer index
	Info_5_Type		info;				// Info record
} Lin_5_Type;							// Lin_405_Type
static_assert (sizeof (Lin_5_Type) == 28, "sizeof (Lin_5_Type) != 28");

typedef struct {
	char			pen;				// color information 0 if deleted
	unsigned char	pattern;			// Pattern/lineType info.
	Geometry::Point2f			begC; 				// Coordinate of the first Point
	Geometry::Point2f			endC;				// Coordinate of the second Point
	short			layer;				// Layer
	Info_5_Type		info;
	short			arrowInd;			// Arrow index OR 0
} Lin_7_Type;							// Lin_416_Type
static_assert (sizeof (Lin_7_Type) == 30, "sizeof (Lin_7_Type) != 30");

typedef struct {
	char			pen;				// color information 0 if deleted
	unsigned char	pattern;			// Pattern/lineType info.
	short			layer;				// Layer
	Int32			unId;				// unique Id
	Info_9_Type		info;				// user information
	Int32			arrowInd;			// Arrow index OR 0
	Geometry::Point2f			begC; 				// Coordinate of the first Point
	Geometry::Point2f			endC;				// Coordinate of the second Point
	Int32			dummy1;
	Int32			dummy2;
} Lin_9_Type;							// LinType
static_assert (sizeof (Lin_9_Type) == 48, "sizeof (Lin_9_Type) != 48");

typedef struct {
	char			pen;				// Color index (0 if deleted)
	char			pattern;			// Pattern/linetype information
	Geometry::Point2f			origC;				// Coordinates of the origin
	float			r;					// Radius
	short			layer;				// Layer index
} Circ_1_Type;							// Circ_343_Type;
static_assert (sizeof (Circ_1_Type) == 16, "sizeof (Circ_1_Type) != 16");

typedef struct {
	char			pen;				// Color index (0 if deleted)
	char			pattern;			// Pattern/linetype information
	Geometry::Point2f			origC;				// Coordinates of the origin
	float			r;					// Radius
	short			layer;				// Layer index
	Info_5_Type		info;				// Info record
} Circ_5_Type;							// Circ_405_Type
static_assert (sizeof (Circ_5_Type) == 24, "sizeof (Circ_5_Type) != 24");

typedef struct {
	char			pen;				// color information 0 if deleted
	unsigned char	pattern;			// Pattern/lineType info.
	Geometry::Point2f			origC;				// Coordinate of the origin
	float			r;					// Radius
	short			layer;				// Layer
	Info_5_Type		info;
	Int32			dummy1;
	Int32			dummy2;				// for angle,reflected...
} Circ_7_Type;							// Circ_416_Type
static_assert (sizeof (Circ_7_Type) == 32, "sizeof (Circ_7_Type) != 32");

typedef struct {
	char			pen;				// Color index (0 if deleted)
	char			pattern;			// Pattern/linetype information
	Geometry::Point2f			origC;				// Coordinates of the origin
	Geometry::Point2f			begC;				// Coordinates of the first point
	Geometry::Point2f			endC;				// Coordinates of the second point
	short			layer;				// Layer index
} Arc_1_Type;							// Arc_343_Type;
static_assert (sizeof (Arc_1_Type) == 28, "sizeof (Arc_1_Type) != 28");

typedef struct {
	char			pen;				// Color index (0 if deleted)
	char			pattern;			// Pattern/linetype information
	Geometry::Point2f			origC;				// Coordinates of the origin
	Geometry::Point2f			begC;				// Coordinates of the first point
	Geometry::Point2f			endC;				// Coordinates of the second point
	short			layer;				// Layer index
	Info_5_Type		info;				// Info record
} Arc_5_Type;							// Arc_405_Type
static_assert (sizeof (Arc_5_Type) == 36, "sizeof (Arc_5_Type) != 36");

typedef struct {
	char			pen;				// color information 0 if deleted
	unsigned char	pattern;			// Pattern/lineType info.
	Geometry::Point2f			origC;				// Coordinate of the origin
	Geometry::Point2f			begC;				// Coordinate of the first Point
	Geometry::Point2f			endC;				// Coordinate of the second Point
	short			layer;				// Layer
	Info_5_Type		info;
	short			arrowInd;			// Arrow index OR 0
} Arc_7_Type;							// Arc_416_Type
static_assert (sizeof (Arc_7_Type) == 38, "sizeof (Arc_7_Type) != 38");

typedef struct {
	char			pen;				// color information 0 if deleted
	unsigned char	pattern;			// Pattern/lineType info.
	short			layer;				// Layer
	Int32			unId;				// unique Id
	Info_9_Type		info;				// user information
	Int32			arrowInd;			// Arrow index OR 0
	Geometry::Point2f			origC;				// Coordinate of the origin
	float			r;					// Radius !!!
	float			angle;				// of the longer axis
	float			ratio;				// longer axis : smaller axis
	float			begAng;				// beginning angle of the arc
	float			endAng;				// ending angle of the arc
	Geometry::Point2f			begC;				// Coordinate of the first Point
	Geometry::Point2f			endC;				// Coordinate of the second Point
	bool			elliptic;			// ratio != 1.0
	bool			reflected;			// on the smaller axis
	bool			whole;				// whole circle or arc?
	char			dummy;
	Int32			dummy1;
	Int32			dummy2;
} Arc_9_Type;							// ArcType; CircType
static_assert (sizeof (Arc_9_Type) == 80, "sizeof (Arc_9_Type) != 80");

//--- Symb2D Version 12 --------------------------------------------------------

DEF_STRUCT_CHECKALIGN (Sy_2DHeadType_12, {						// Symbol 2D handle header record (72 Byte)
	Int32			item_Len;			// length of the data record = sizeof(Sy_2DHeadType_12)
	unsigned char	item_Typ;			// = SyHead (1)
	unsigned char	headVers;			// = 12
	unsigned char	valid2DScriptBin;	// 2D script is valid
	unsigned char	dummyB;
	F_BoxType		box; 				// Boundaries of the Symbol's immage
	Int32			endOff;				// offset of the end record from section start
	Int32			nHots;				// Number of hotspots in the Symbol
	Int32			hotsOff;			// Offset of the hotspots from section start
	Int32			nLine;				// Number of lines in the Symbol
	Int32			linOff;				// Offset of the lines from section start
	Int32			nArc;				// Number of arcs in the Symbol
	Int32			arcOff;				// Offset of the arcs from section start
	Int32			nText;				// Number of Texts in the Symbol
